techcap/netmf-interpreter/Solutions/SPE_Controller/DeviceCode/TouchPanel_HAL/stm32f429i_discovery_ioe.cpp
/**
  ******************************************************************************
  * @file    stm32f429i_discovery_ioe.c
  * @author  MCD Application Team
  * @version V1.0.0RC1
  * @date    13-Sep-2013
  * @brief   This file provides a set of functions needed to manage the STMPE811
  *          IO Expander device mounted on STM32F429I-DISCO Kit.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2013 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software
  * distributed under the License is distributed on an "AS IS" BASIS,
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */

  /* File Info : ---------------------------------------------------------------

	Note:
	-----
	- This driver uses the DMA method for sending and receiving data on I2C bus
	  which allow higher efficiency and reliability of the communication.

	SUPPORTED FEATURES:
	  - Touch Panel Features: Single point mode (Polling/Interrupt)


	UNSUPPORTED FEATURES:
	  - IO Read/write : Set/Reset and Read (Polling/Interrupt)
	  - TempSensor Feature: accuracy not determined (Polling).
	  - Row ADC Feature is not supported (not implemented on STM32F429I_DISCO board)
  ----------------------------------------------------------------------------*/

  /* Includes ------------------------------------------------------------------*/
#include "stm32f429i_discovery_ioe.h"

/** @addtogroup Utilities
  * @{
  */

  /** @addtogroup STM32F4_DISCOVERY
	* @{
	*/

	/** @addtogroup STM32F429I_DISCOVERY
	  * @{
	  */

	  /** @defgroup STM32F429I_DISCOVERY_IOE
		* @brief  This file includes the IO Expander driver for STMPE811 IO Expander
		*         devices.
		* @{
		*/


		/** @defgroup STM32F429I_DISCOVERY_IOE_Private_TypesDefinitions
		  * @{
		  */
		  /**
			* @}
			*/


			/** @defgroup STM32F429I_DISCOVERY_IOE_Private_Defines
			  * @{
			  */
#define TIMEOUT_MAX    0x3000 /*<! The value of the maximal timeout for I2C waiting loops */
			  /**
				* @}
				*/


				/** @defgroup STM32F429I_DISCOVERY_IOE_Private_Macros
				  * @{
				  */
				  /**
					* @}
					*/

					/** @defgroup STM32F429I_DISCOVERY_IOE_Private_Variables
					  * @{
					  */
TP_STATE TP_State;              /* The global structure holding the TS state */

uint32_t IOE_TimeOut = TIMEOUT_MAX; /* Value of Timeout when I2C communication fails */
/**
  * @}
  */


  /** @defgroup STM32F429I_DISCOVERY_IOE_Private_FunctionPrototypes
	* @{
	*/
static uint16_t IOE_TP_Read_X(void);
static uint16_t IOE_TP_Read_Y(void);
static uint16_t IOE_TP_Read_Z(void);
static void     IOE_GPIO_Config(void);
static void     IOE_I2C_Config(void);
static void     IOE_DMA_Config(IOE_DMADirection_TypeDef Direction, uint8_t* buffer);

#ifndef USE_Delay
static void delay(__IO uint32_t nCount);
#endif /* USE_Delay */
/**
  * @}
  */


  /** @defgroup STM32F429I_DISCOVERY_IOE_Private_Functions
	* @{
	*/


	/**
	  * @brief  Initializes and Configures the IO_Expander Touch Panel Functionality
	  *         and configures all STM32F429I_DISCO necessary
	  *         hardware (GPIOs, APB clocks ..).
	  * @param  None
	  * @retval IOE_OK if all initializations done correctly. Other value if error.
	  */
uint8_t IOE_Config(void)
{
	/* Configure the needed pins */
	IOE_GPIO_Config();

	/* I2C initialization */
	IOE_I2C_Config();

	/* Read IO Expander ID  */
	if (IOE_IsOperational())
	{
		return IOE_NOT_OPERATIONAL;
	}

	/* Generate IO Expander Software reset */
	IOE_Reset();

	/* IO Expander configuration */
	/* Touch Panel controller and ADC configuration */
	IOE_FnctCmd(IOE_ADC_FCT, ENABLE);
	IOE_TP_Config();

	/* Configuration is OK */
	return IOE_OK;
}

/**
  * @brief  Enables the touch Panel interrupt.
  * @retval IOE_OK: if all initializations are OK. Other value if error.
  */
uint8_t IOE_TPITConfig(void)
{
	/* Enable the Global interrupt */
	IOE_GITCmd(ENABLE);

	/* Enable the Global GPIO Interrupt */
	IOE_GITConfig((uint8_t)(IOE_GIT_TOUCH | IOE_GIT_FTH | IOE_GIT_FOV), ENABLE);

	/* Read the GPIO_IT_STA to clear all pending bits if any */
	I2C_ReadDeviceRegister(IOE_REG_GPIO_INT_STA);

	/* If all OK return IOE_OK */
	return IOE_OK;
}

/**
  * @brief  Returns Status and positions of the Touch Panel.
  * @param  None
  * @retval Pointer to TP_STATE structure holding Touch Panel information.
  */
TP_STATE* IOE_TP_GetState(void)
{
	uint32_t xDiff, yDiff, x, y;
	static uint32_t _x = 0, _y = 0;

	/* Check if the Touch detect event happened */
	TP_State.TouchDetected = (I2C_ReadDeviceRegister(IOE_REG_TP_CTRL) & 0x80);

	if (TP_State.TouchDetected)
	{
		x = IOE_TP_Read_X();
		y = IOE_TP_Read_Y();
		xDiff = x > _x ? (x - _x) : (_x - x);
		yDiff = y > _y ? (y - _y) : (_y - y);
		if (xDiff + yDiff > 5)
		{
			_x = x;
			_y = y;
		}
	}
	/* Update the X position */
	TP_State.X = _x;

	/* Update the Y position */
	TP_State.Y = _y;
	/* Update the Z Pression index */
	TP_State.Z = IOE_TP_Read_Z();

	/* Clear the interrupt pending bit and enable the FIFO again */
	I2C_WriteDeviceRegister(IOE_REG_FIFO_STA, 0x01);
	I2C_WriteDeviceRegister(IOE_REG_FIFO_STA, 0x00);

	/* Return pointer to the updated structure */
	return &TP_State;
}

/**
  * @brief  Checks the selected Global interrupt source pending bit
  * @param  Global_IT: the Global interrupt source to be checked, could be:
  *   @arg  Global_IT_ADC : ADC interrupt
  *   @arg  Global_IT_FE : Touch Panel Controller FIFO Error interrupt
  *   @arg  Global_IT_FF : Touch Panel Controller FIFO Full interrupt
  *   @arg  Global_IT_FOV : Touch Panel Controller FIFO Overrun interrupt
  *   @arg  Global_IT_FTH : Touch Panel Controller FIFO Threshold interrupt
  *   @arg  Global_IT_TOUCH : Touch Panel Controller Touch Detected interrupt
  * @retval Status of the checked flag. Could be SET or RESET.
  */
FlagStatus IOE_GetGITStatus(uint8_t Global_IT)
{
	__IO uint8_t tmp = 0;

	/* Get the Interrupt status */
	tmp = I2C_ReadDeviceRegister(IOE_REG_INT_STA);

	if ((tmp & (uint8_t)Global_IT) != 0)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/**
  * @brief  Clears the selected Global interrupt pending bit(s)
  * @param  Global_IT: the Global interrupt to be cleared, could be any combination
  *         of the following values:
  *   @arg  Global_IT_ADC : ADC interrupt
  *   @arg  Global_IT_TEMP : Temperature Sensor interrupts
  *   @arg  Global_IT_FE : Touch Panel Controller FIFO Error interrupt
  *   @arg  Global_IT_FF : Touch Panel Controller FIFO Full interrupt
  *   @arg  Global_IT_FOV : Touch Panel Controller FIFO Overrun interrupt
  *   @arg  Global_IT_FTH : Touch Panel Controller FIFO Threshold interrupt
  *   @arg  Global_IT_TOUCH : Touch Panel Controller Touch Detected interrupt
  * @retval IOE_OK: if all initializations are OK. Other value if error.
  */
uint8_t IOE_ClearGITPending(uint8_t Global_IT)
{
	/* Write 1 to the bits that have to be cleared */
	I2C_WriteDeviceRegister(IOE_REG_INT_STA, Global_IT);

