techcap/netmf-interpreter/Solutions/SPE_Controller/DeviceCode/TouchPanel_HAL/stm32f429i_discovery_ioe.cpp
	/* return a pointer to the IOE_Buffer */
	return (uint8_t)IOE_BufferRX[0];
}


/**
  * @brief  Reads a buffer of 2 bytes from the device registers.
  * @param  RegisterAddr: The target register address (between 00x and 0x24)
  * @retval A pointer to the buffer containing the two returned bytes (in halfword).
  */
uint16_t I2C_DMA_ReadDataBuffer(uint32_t RegisterAddr)
{
	uint8_t tmp = 0;
	uint8_t IOE_BufferRX[2] = { 0x00, 0x00 };

	/* Configure DMA Peripheral */
	IOE_DMA_Config(IOE_DMA_RX, (uint8_t*)IOE_BufferRX);

	/* Enable DMA NACK automatic generation */
	I2C_DMALastTransferCmd(IOE_I2C, ENABLE);

	/* Enable the I2C peripheral */
	I2C_GenerateSTART(IOE_I2C, ENABLE);

	/* Test on SB Flag */
	IOE_TimeOut = TIMEOUT_MAX;
	while (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_SB))
	{
		if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
	}

	/* Send device address for write */
	I2C_Send7bitAddress(IOE_I2C, IOE_ADDR, I2C_Direction_Transmitter);

	/* Test on ADDR Flag */
	IOE_TimeOut = TIMEOUT_MAX;
	while (!I2C_CheckEvent(IOE_I2C, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
	{
		if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
	}

	/* Send the device's internal address to write to */
	I2C_SendData(IOE_I2C, RegisterAddr);

	/* Test on TXE FLag (data dent) */
	IOE_TimeOut = TIMEOUT_MAX;
	while ((!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_TXE)) && (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_BTF)))
	{
		if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
	}

	/* Send START condition a second time */
	I2C_GenerateSTART(IOE_I2C, ENABLE);

	/* Test on SB Flag */
	IOE_TimeOut = TIMEOUT_MAX;
	while (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_SB))
	{
		if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
	}

	/* Send IO Expander address for read */
	I2C_Send7bitAddress(IOE_I2C, IOE_ADDR, I2C_Direction_Receiver);

	/* Test on ADDR Flag */
	IOE_TimeOut = TIMEOUT_MAX;
	while (!I2C_CheckEvent(IOE_I2C, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED))
	{
		if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
	}

	/* Enable I2C DMA request */
	I2C_DMACmd(IOE_I2C, ENABLE);

	/* Enable DMA RX Channel */
	DMA_Cmd(IOE_DMA_RX_STREAM, ENABLE);

	/* Wait until DMA Transfer Complete */
	IOE_TimeOut = 2 * TIMEOUT_MAX;
	while (!DMA_GetFlagStatus(IOE_DMA_RX_STREAM, IOE_DMA_RX_TCFLAG))
	{
		if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
	}

	/* Send STOP Condition */
	I2C_GenerateSTOP(IOE_I2C, ENABLE);

	/* Disable DMA RX Channel */
	DMA_Cmd(IOE_DMA_RX_STREAM, DISABLE);

	/* Disable I2C DMA request */
	I2C_DMACmd(IOE_I2C, DISABLE);

	/* Clear DMA RX Transfer Complete Flag */
	DMA_ClearFlag(IOE_DMA_RX_STREAM, IOE_DMA_RX_TCFLAG);

	/* Reorganize received data */
	tmp = IOE_BufferRX[0];
	IOE_BufferRX[0] = IOE_BufferRX[1];
	IOE_BufferRX[1] = tmp;

	/* return the data */
	return *(__IO uint16_t *) (IOE_BufferRX[0] | (uint16_t)IOE_BufferRX[1] << 8);
}


/**
  * @brief  Return Touch Panel X position value
  * @param  None
  * @retval X position.
  */
static uint16_t IOE_TP_Read_X(void)
{
	int32_t x, xr;

	/* Read x value from DATA_X register */
	x = I2C_ReadDataBuffer(IOE_REG_TP_DATA_X);

	/* x value first correction */
	if (x <= 3000)
	{
		x = 3870 - x;
	}
	else
	{
		x = 3800 - x;
	}

	/* x value second correction */
	xr = x / 15;

	/* return x position value */
	if (xr <= 0)
	{
		xr = 0;
	}
	else if (xr > 240)
	{
		xr = 239;
	}
	else
	{
	}
	return (uint16_t)(xr);
}

/**
  * @brief  Return Touch Panel Y position value
  * @param  None
  * @retval Y position.
  */
static uint16_t IOE_TP_Read_Y(void)
{
	int32_t y, yr;

	/* Read y value from DATA_Y register */
	y = I2C_ReadDataBuffer(IOE_REG_TP_DATA_Y);

	/* y value first correction */

	y -= 360;

	/* y value second correction */
	yr = y / 11;

	/* return y position value */
	if (yr <= 0)
	{
		yr = 0;
	}
	else if (yr > 320)
	{
		yr = 319;
	}
	else
	{
	}
	return (uint16_t)(yr);
}

/**
  * @brief  Return Touch Panel Z position value
  * @param  None
  * @retval Z position.
  */
static uint16_t IOE_TP_Read_Z(void)
{
	uint32_t z;

	/* Read z value from DATA_Z register */
	z = I2C_ReadDataBuffer(IOE_REG_TP_DATA_Z);

	/* return z position value */
	if (z <= 0)
		z = 0;
	return (uint16_t)(z);
}

/**
  * @brief  Initializes the GPIO pins used by the IO expander.
  * @param  None
  * @retval None
  */
static void IOE_GPIO_Config(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;

	/* Enable IOE_I2C and IOE_I2C_GPIO_PORT & Alternate Function clocks */
	RCC_APB1PeriphClockCmd(IOE_I2C_CLK, ENABLE);
	RCC_AHB1PeriphClockCmd(IOE_I2C_SCL_GPIO_CLK | IOE_I2C_SDA_GPIO_CLK |
		IOE_IT_GPIO_CLK, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);

	/* Reset IOE_I2C IP */
	RCC_APB1PeriphResetCmd(IOE_I2C_CLK, ENABLE);
	/* Release reset signal of IOE_I2C IP */
	RCC_APB1PeriphResetCmd(IOE_I2C_CLK, DISABLE);

	/* Connect PXx to I2C_SCL*/
	GPIO_PinAFConfig(IOE_I2C_SCL_GPIO_PORT, IOE_I2C_SCL_SOURCE, IOE_I2C_SCL_AF);
	/* Connect PXx to I2C_SDA*/
	GPIO_PinAFConfig(IOE_I2C_SDA_GPIO_PORT, IOE_I2C_SDA_SOURCE, IOE_I2C_SDA_AF);

	/* IOE_I2C SCL and SDA pins configuration */
	GPIO_InitStructure.GPIO_Pin = IOE_I2C_SCL_PIN;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;//GPIO_PuPd_NOPULL;
	GPIO_Init(IOE_I2C_SCL_GPIO_PORT, &GPIO_InitStructure);

	GPIO_InitStructure.GPIO_Pin = IOE_I2C_SDA_PIN;
	GPIO_Init(IOE_I2C_SDA_GPIO_PORT, &GPIO_InitStructure);

}

/**
  * @brief  Configure the I2C Peripheral used to communicate with IO_Expanders.
  * @param  None
  * @retval None
  */
static void IOE_I2C_Config(void)
{
	I2C_InitTypeDef I2C_InitStructure;

	/* IOE_I2C configuration */
	I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
	I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
	I2C_InitStructure.I2C_OwnAddress1 = 0x00;
	I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
	I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
	I2C_InitStructure.I2C_ClockSpeed = I2C_SPEED;

