techcap/netmf-interpreter/Solutions/SPE_Controller/DeviceCode/TouchPanel_HAL/stm32f429i_discovery_ioe.cpp
	/* Initialize the I2C peripheral */
	I2C_Init(IOE_I2C, &I2C_InitStructure);

	/* Enable the I2C peripheral */
	I2C_Cmd(IOE_I2C, ENABLE);
}

/**
  * @brief  Configure the DMA Peripheral used to handle communication via I2C.
  * @param  None
  * @retval None
  */

static void IOE_DMA_Config(IOE_DMADirection_TypeDef Direction, uint8_t* buffer)
{
	DMA_InitTypeDef DMA_InitStructure;

	RCC_AHB1PeriphClockCmd(IOE_DMA_CLK, ENABLE);

	/* Initialize the DMA_Channel member */
	DMA_InitStructure.DMA_Channel = IOE_DMA_CHANNEL;

	/* Initialize the DMA_PeripheralBaseAddr member */
	DMA_InitStructure.DMA_PeripheralBaseAddr = IOE_I2C_DR;

	/* Initialize the DMA_Memory0BaseAddr member */
	DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)buffer;

	/* Initialize the DMA_PeripheralInc member */
	DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;

	/* Initialize the DMA_MemoryInc member */
	DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;

	/* Initialize the DMA_PeripheralDataSize member */
	DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;

	/* Initialize the DMA_MemoryDataSize member */
	DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;

	/* Initialize the DMA_Mode member */
	DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;

	/* Initialize the DMA_Priority member */
	DMA_InitStructure.DMA_Priority = DMA_Priority_Low;

	/* Initialize the DMA_FIFOMode member */
	DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Enable;

	/* Initialize the DMA_FIFOThreshold member */
	DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_1QuarterFull;

	/* Initialize the DMA_MemoryBurst member */
	DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;

	/* Initialize the DMA_PeripheralBurst member */
	DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;

	/* If using DMA for Reception */
	if (Direction == IOE_DMA_RX)
	{
		/* Initialize the DMA_DIR member */
		DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralToMemory;

		/* Initialize the DMA_BufferSize member */
		DMA_InitStructure.DMA_BufferSize = 2;

		DMA_DeInit(IOE_DMA_RX_STREAM);

		DMA_Init(IOE_DMA_RX_STREAM, &DMA_InitStructure);
	}
	/* If using DMA for Transmission */
	else if (Direction == IOE_DMA_TX)
	{
		/* Initialize the DMA_DIR member */
		DMA_InitStructure.DMA_DIR = DMA_DIR_MemoryToPeripheral;

		/* Initialize the DMA_BufferSize member */
		DMA_InitStructure.DMA_BufferSize = 1;

		DMA_DeInit(IOE_DMA_TX_STREAM);

		DMA_Init(IOE_DMA_TX_STREAM, &DMA_InitStructure);
	}
}

/**
  * @brief  Writes a value in a register of the device through I2C.
  * @param  RegisterAddr: The target register address
  * @param  RegisterValue: The target register value to be written
  * @retval IOE_OK: if all operations are OK. Other value if error.
  */
uint8_t I2C_WriteDeviceRegister(uint8_t RegisterAddr, uint8_t RegisterValue)
{
	uint32_t read_verif = 0;
	__IO uint16_t SR2_tmp;

	/* Begin the configuration sequence */
	I2C_GenerateSTART(IOE_I2C, ENABLE);

	/* Test on EV5 and clear it */
	IOE_TimeOut = TIMEOUT_MAX;
	while (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_SB))
	{
		if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
	}

	/* Transmit the slave address and enable writing operation */
	I2C_Send7bitAddress(IOE_I2C, IOE_ADDR, I2C_Direction_Transmitter);

	/* Test on EV6 and clear it */
	IOE_TimeOut = TIMEOUT_MAX;
	while (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_ADDR))
	{
		if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
	}

	/* Read status register 2 to clear ADDR flag */
	SR2_tmp |= IOE_I2C->SR2;

	/* Test on EV8_1 and clear it */
	IOE_TimeOut = TIMEOUT_MAX;
	while (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_TXE))
	{
		if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
	}

	/* Transmit the first address for r/w operations */
	I2C_SendData(IOE_I2C, RegisterAddr);

	/* Test on EV8 and clear it */
	IOE_TimeOut = TIMEOUT_MAX;
	while (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_TXE))
	{
		if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
	}

	/* Prepare the register value to be sent */
	I2C_SendData(IOE_I2C, RegisterValue);

	/* Test on EV8_2 and clear it */
	IOE_TimeOut = TIMEOUT_MAX;
	while ((!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_TXE)) || (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_BTF)))
	{
		if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
	}

	/* End the configuration sequence */
	I2C_GenerateSTOP(IOE_I2C, ENABLE);

#ifdef VERIFY_WRITTENDATA
	/* Verify (if needed) that the loaded data is correct  */

	/* Read the just written register*/
	read_verif = IOE_I2C_ReadDeviceRegister(RegisterAddr);

	/* Load the register and verify its value  */
	if (read_verif != RegisterValue)
	{
		/* Control data wrongly transferred */
		read_verif = IOE_FAILURE;
	}
	else
	{
		/* Control data correctly transferred */
		read_verif = 0;
	}
#endif

	/* Return the verifying value: 0 (Passed) or 1 (Failed) */
	return read_verif;

}


/**
  * @brief  Reads a register of the device through I2C without DMA.
  * @param  RegisterAddr: The target register address (between 00x and 0x24)
  * @retval The value of the read register (0xAA if Timeout occurred)
  */
uint8_t I2C_ReadDeviceRegister(uint8_t RegisterAddr)
{
	uint8_t tmp = 0;
	__IO uint16_t SR2_tmp;

	/* Enable the I2C peripheral */
	I2C_GenerateSTART(IOE_I2C, ENABLE);

	/* Test on EV5 and clear it */
	IOE_TimeOut = TIMEOUT_MAX;
	while (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_SB))
	{
		if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
	}
	/* Disable Acknowledgement */
	I2C_AcknowledgeConfig(IOE_I2C, DISABLE);

	/* Transmit the slave address and enable writing operation */
	I2C_Send7bitAddress(IOE_I2C, IOE_ADDR, I2C_Direction_Transmitter);

	/* Test on EV6 and clear it */
	IOE_TimeOut = TIMEOUT_MAX;
	while (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_ADDR))
	{
		if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
	}

